v2206/solver_ADMFoam/multi_ADM/0.orig/Gco2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Gco2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0]; // actually (mol C m-3)

// internalField   uniform 0.0135; // <- (kmol C m-3)

// boundaryField
// {
//     movingWall
//     {
//         type            fixedValue;
//         value           uniform 0.0135;
//     }

internalField   uniform 13.5;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }

    left
    {
        type            zeroGradient;
    }

    right
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
