v2206/solver_ADMFoam/multi_ADM/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [0 2 -2 0 0 0 0];    // <-- Pressure/Density
dimensions      [1 -1 -2 0 0 0 0];      // <-- Pascal

internalField   uniform 0;

boundaryField
{
    // movingWall
    // {
    //     type            zeroGradient;
    //     // type            fixedValue; //inletOutlet;
    //     // value           uniform 0;
    // }

    // fixedWalls
    // {
    //     type            zeroGradient;
    // }

    bottom
    {
        type            calculated;
        value           $internalField;
    }

    top
    {
        type            calculated;
        value           $internalField;
    }

    left
    {
        type            calculated;
        value           $internalField;
    }

    right
    {
        type            calculated;
        value           $internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
