v2206/solver_ADMFoam/multi_ADM/constant/admno1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      admno1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Operation modes
mode            MesoSolid;

// Schmidt number
Sc              1;

// Gas constant [Pa * K-1 * (mol/m3)-1]
R               8.3145;

// Default pH value
pH              7.26;

// Cation concentration [mol * m-3]
Scat            0.00;

// Anion concentration [mol * m-3]
San             5.20;

// Vapour pressure of water [Pa]
Pvap            3130;

amp             10;



// Benchmark case
// Pipe resistance [m3 * d * Pa]
Kpip            0.5;

// External pressure [Pa]
Pext            101300;



// ************************************************************************* //